src/cf/Catalogs/СлужбыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СлужбыДоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФормулаСтоимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаСебестоимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЯндекса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможенСамопривозНаЕдиныйСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможенЗаборНаЕдиныйСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможенСамопривозНаСкладСлужбыДоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможенЗаборНаСкладСлужбыДоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыРасчетовДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСпособыДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособДоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСпособыОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособОтгрузки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОтгрузки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СлужбыДоставки/Forms/ФормаРедактированияФормул/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстФормулы", ТекстФормулы);
	Значения = Неопределено;
	
	ДоставкаСервер.ЗаполнитьДеревоПараметровРасчета(ПараметрыРасчетов, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="Запись_ПараметрыРасчетовДоставки" Тогда
		ОбновитьДеревоПараметровРасчета();
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПараметрыРасчетовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	СтруктураОткрытия = Новый Структура;
	Если Копирование Тогда
		ТекущаяСтрока = Элемент.ТекущиеДанные;
		Если ТекущаяСтрока=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Параметр) Тогда
			Возврат;
		КонецЕсли;
		СтруктураОткрытия.Вставить("ЗначениеКопирования", ТекущаяСтрока.Параметр);
	КонецЕсли; 
	ОткрытьФорму("Справочник.ПараметрыРасчетовДоставки.ФормаОбъекта", СтруктураОткрытия, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбновитьДеревоПараметровРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока=Неопределено ИЛИ ПустаяСтрока(ТекущаяСтрока.Идентификатор) Тогда
		Возврат
	КонецЕсли;
	Если ТекущаяСтрока.ПолучитьЭлементы().Количество()>0 Тогда
		Возврат
	КонецЕсли; 
	ВставитьТекстВФормулу(ТекущаяСтрока.Идентификатор);

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьПоказатель(Команда)
	
	СтруктураОткрытия = Новый Структура;
	ТекущаяСтрока = Элементы.ПараметрыРасчетов.ТекущиеДанные;
	Если ТекущаяСтрока=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Параметр) Тогда
		Возврат;
	КонецЕсли;
	СтруктураОткрытия.Вставить("Ключ", ТекущаяСтрока.Параметр);
	ОткрытьФорму("Справочник.ПараметрыРасчетовДоставки.ФормаОбъекта", СтруктураОткрытия, Элементы.ПараметрыРасчетов, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТекстФормулы", УдалитьЛишниеСимволы(ТекстФормулы));
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВставитьТекстВФормулу(Показатель)
	
	ТекстФормулы = ТекстФормулы + " [" + СокрЛП(Показатель) + "] ";
			
КонецПроцедуры // ВставитьТекстВФормулу()	

&НаКлиентеНаСервереБезКонтекста
Функция УдалитьЛишниеСимволы(Текст)
	
	Результат = Текст;
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	Результат = СокрЛП(Результат);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьДеревоПараметровРасчета()
	
	ДоставкаСервер.ЗаполнитьДеревоПараметровРасчета(ПараметрыРасчетов, Истина);
	
КонецПроцедуры
 
#КонецОбласти
